# MasonryCMUColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MasonryCMU..::..MasonryCMUColor Property
MasonryCMU Class See Also
---
The property labeled "Color" from the "MasonryCMU" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MasonryCMUColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MasonryCMUColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ MasonryCMUColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace